[Survived] ArrayDeclaration
src/integrate.js:3:13
 // user.js
 
-let users = [];
+let users = ["Stryker was here"];
 
 function addUser(user) {

[Killed] BlockStatement
src/integrate.js:5:24
 
 let users = [];
 
-function addUser(user) {
-  users.push(user);
-}
+function addUser(user) {}
 
 function getUser(username) {
killedBy: User Management getUser function retrieves a user by username
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"email": "test@example.com", "username": "testUser"}
Received: undefined

[Killed] BlockStatement
src/integrate.js:9:28
   users.push(user);
 }
 
-function getUser(username) {
-  return users.find(user => user.username === username);
-}
+function getUser(username) {}
 
 function deleteUser(username) {
killedBy: User Management getUser function retrieves a user by username
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"email": "test@example.com", "username": "testUser"}
Received: undefined

[Killed] EqualityOperator
src/integrate.js:10:29
 }
 
 function getUser(username) {
-  return users.find(user => user.username === username);
+  return users.find(user => user.username !== username);
 }
 
killedBy: User Management getUser function retrieves a user by username
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"email": "test@example.com", "username": "testUser"}
Received: undefined

[Killed] ConditionalExpression
src/integrate.js:10:29
 }
 
 function getUser(username) {
-  return users.find(user => user.username === username);
+  return users.find(user => false);
 }
 
killedBy: User Management getUser function retrieves a user by username
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"email": "test@example.com", "username": "testUser"}
Received: undefined

[Survived] BlockStatement
src/integrate.js:13:31
   return users.find(user => user.username === username);
 }
 
-function deleteUser(username) {
-  users = users.filter(user => user.username !== username);
-}
+function deleteUser(username) {}
 
 module.exports = {

[Survived] ArrowFunction
src/integrate.js:14:24
 }
 
 function deleteUser(username) {
-  users = users.filter(user => user.username !== username);
+  users = users.filter(() => undefined);
 }
 

[Survived] ConditionalExpression
src/integrate.js:14:32
 }
 
 function deleteUser(username) {
-  users = users.filter(user => user.username !== username);
+  users = users.filter(user => false);
 }
 
