[Killed] BlockStatement
src/advanced.js:1:19
-function pow(a, b){
-    let power=1;
-    for(let i=0; i<b; i++){
-        power = power*a;
-    }
-    return power;
-}
+function pow(a, b){}
 
 function modulo(a, b){
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Killed] ConditionalExpression
src/advanced.js:3:18
 function pow(a, b){
     let power=1;
-    for(let i=0; i<b; i++){
+    for(let i=0; false; i++){
         power = power*a;
     }
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] EqualityOperator
src/advanced.js:3:18
 function pow(a, b){
     let power=1;
-    for(let i=0; i<b; i++){
+    for(let i=0; i <= b; i++){
         power = power*a;
     }
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ArithmeticOperator
src/advanced.js:4:17
 function pow(a, b){
     let power=1;
     for(let i=0; i<b; i++){
-        power = power*a;
+        power = power / a;
     }
     return power;
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: Infinity

[Killed] BlockStatement
src/advanced.js:9:22
     return power;
 }
 
-function modulo(a, b){
-    return a%b
-}
+function modulo(a, b){}
 
 console.log(pow(4, 3))
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] ArithmeticOperator
src/advanced.js:10:12
 }
 
 function modulo(a, b){
-    return a%b
+    return a * b
 }
 
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: NaN
Received: 0
