[Killed] BlockStatement
src/basic.js:1:19
-function add(a, b){
-    return a+b
-}
+function add(a, b){}
 
 function subtract(a, b){
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: undefined

[Killed] ArithmeticOperator
src/basic.js:2:12
 function add(a, b){
-    return a+b
+    return a - b
 }
 
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: -1

[Killed] BlockStatement
src/basic.js:5:24
     return a+b
 }
 
-function subtract(a, b){
-    return a-b
-}
+function subtract(a, b){}
 
 function multiply(a, b){
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: -1
Received: undefined

[Killed] ArithmeticOperator
src/basic.js:6:12
 }
 
 function subtract(a, b){
-    return a-b
+    return a + b
 }
 
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: -1
Received: 3

[Killed] BlockStatement
src/basic.js:9:24
     return a-b
 }
 
-function multiply(a, b){
-    return a*b
-}
+function multiply(a, b){}
 
 function divide(a, b){
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: undefined

[Killed] ArithmeticOperator
src/basic.js:10:12
 }
 
 function multiply(a, b){
-    return a*b
+    return a / b
 }
 
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0.5

[Killed] BlockStatement
src/basic.js:13:22
     return a*b
 }
 
-function divide(a, b){
-    return a/b
-}
+function divide(a, b){}
 
 console.log(add(1, 2))
statusReason: Error: expect(received).toBeCloseTo(expected)

Matcher error: received value must be a number

Received has value: undefined

[Killed] ArithmeticOperator
src/basic.js:14:12
 }
 
 function divide(a, b){
-    return a/b
+    return a * b
 }
 
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 0.5
Received: 2

Expected precision:    2
Expected difference: < 0.005
Received difference:   1.5
