[Killed] BlockStatement
src/sorting.js:1:29
-function selectionSort(arr) {
-    const n = arr.length;
-
-    for (let i = 0; i < n - 1; i++) {
-        let minIndex = i;
-
-        for (let j = i + 1; j < n; j++) {
-            if (arr[j] < arr[minIndex]) {
-                minIndex = j;
-            }
-        }
-
-        if (minIndex !== i) {
-            // Swap elements
-            [arr[i], arr[minIndex]] = [arr[minIndex], arr[i]];
-        }
-    }
-
-    return arr;
-}
+function selectionSort(arr) {}
 
 // Example usage:
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: []
Received: undefined

[Killed] BlockStatement
src/sorting.js:4:37
 function selectionSort(arr) {
     const n = arr.length;
 
-    for (let i = 0; i < n - 1; i++) {
-        let minIndex = i;
-
-        for (let j = i + 1; j < n; j++) {
-            if (arr[j] < arr[minIndex]) {
-                minIndex = j;
-            }
-        }
-
-        if (minIndex !== i) {
-            // Swap elements
-            [arr[i], arr[minIndex]] = [arr[minIndex], arr[i]];
-        }
-    }
+    for (let i = 0; i < n - 1; i++) {}
 
     return arr;
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   1,
    2,

[Killed] ArithmeticOperator
src/sorting.js:7:22
     for (let i = 0; i < n - 1; i++) {
         let minIndex = i;
 
-        for (let j = i + 1; j < n; j++) {
+        for (let j = i - 1; j < n; j++) {
             if (arr[j] < arr[minIndex]) {
                 minIndex = j;
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
+   3,
    1,

[Killed] BlockStatement
src/sorting.js:7:41
     for (let i = 0; i < n - 1; i++) {
         let minIndex = i;
 
-        for (let j = i + 1; j < n; j++) {
-            if (arr[j] < arr[minIndex]) {
-                minIndex = j;
-            }
-        }
+        for (let j = i + 1; j < n; j++) {}
 
         if (minIndex !== i) {
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   1,
    2,

[Killed] EqualityOperator
src/sorting.js:8:17
         let minIndex = i;
 
         for (let j = i + 1; j < n; j++) {
-            if (arr[j] < arr[minIndex]) {
+            if (arr[j] >= arr[minIndex]) {
                 minIndex = j;
             }
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   1,
    2,

[Killed] BlockStatement
src/sorting.js:13:29
             }
         }
 
-        if (minIndex !== i) {
-            // Swap elements
-            [arr[i], arr[minIndex]] = [arr[minIndex], arr[i]];
-        }
+        if (minIndex !== i) {}
     }
 
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   1,
    2,

[Killed] BlockStatement
src/sorting.js:27:29
 console.log("Selection Sort Result:", selectionSortResult);
 
 
-function insertionSort(arr) {
-    const n = arr.length;
-
-    for (let i = 1; i < n; i++) {
-        let key = arr[i];
-        let j = i - 1;
-
-        while (j >= 0 && arr[j] > key) {
-            arr[j + 1] = arr[j];
-            j--;
-        }
-
-        arr[j + 1] = key;
-    }
-
-    return arr;
-}
+function insertionSort(arr) {}
 
 // Example usage:
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: []
Received: undefined

[Killed] BlockStatement
src/sorting.js:30:33
 function insertionSort(arr) {
     const n = arr.length;
 
-    for (let i = 1; i < n; i++) {
-        let key = arr[i];
-        let j = i - 1;
-
-        while (j >= 0 && arr[j] > key) {
-            arr[j + 1] = arr[j];
-            j--;
-        }
-
-        arr[j + 1] = key;
-    }
+    for (let i = 1; i < n; i++) {}
 
     return arr;
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   1,
    2,

[Killed] ConditionalExpression
src/sorting.js:30:21
 function insertionSort(arr) {
     const n = arr.length;
 
-    for (let i = 1; i < n; i++) {
+    for (let i = 1; false; i++) {
         let key = arr[i];
         let j = i - 1;
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   1,
    2,

[Killed] ConditionalExpression
src/sorting.js:34:26
         let key = arr[i];
         let j = i - 1;
 
-        while (j >= 0 && arr[j] > key) {
+        while (j >= 0 && true) {
             arr[j + 1] = arr[j];
             j--;
killedBy: insertionSort BVAdata: insertionSort([2, 1]), Expected: [1, 2] returns 1,2
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   1,
    2,

[Killed] EqualityOperator
src/sorting.js:34:16
         let key = arr[i];
         let j = i - 1;
 
-        while (j >= 0 && arr[j] > key) {
+        while (j > 0 && arr[j] > key) {
             arr[j + 1] = arr[j];
             j--;
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   1,
    2,

[Killed] ArithmeticOperator
src/sorting.js:39:13
             j--;
         }
 
-        arr[j + 1] = key;
+        arr[j - 1] = key;
     }
 
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   1,
+   2,

[Survived] StringLiteral
src/sorting.js:47:13
 
 // Example usage:
 const insertionSortResult = insertionSort([64, 25, 12, 22, 11]);
-console.log("Insertion Sort Result:", insertionSortResult);
+console.log("", insertionSortResult);
 
 
